ERP.belugaerp/src/Documents/битПоступлениеДенежныхСредствОтРозничногоПокупателя/битПоступлениеДенежныхСредствОтРозничногоПокупателя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>битПоступлениеДенежныхСредствОтРозничногоПокупателя</name>
  <objectBelonging>Adopted</objectBelonging>
  <registerRecords>AccumulationRegister.бг_РасчетыСРозничнымиКлиентами</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаПоДокументу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Оплаты</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВРозницу</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОтгрузки</name>
      <type>
        <types>DocumentRef.РеализацияТоваровУслуг</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ERP.belugaerp/src/AccumulationRegisters/бг_РасчетыСРозничнымиКлиентами/бг_РасчетыСРозничнымиКлиентами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>бг_РасчетыСРозничнымиКлиентами</name>
  <resources>
    <name>СуммаВРозницу</name>
    <comment>Сумма продажи в рознице</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныВГО</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидЦеныРозница</name>
    <type>
      <types>CatalogRef.ВидыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказРозничногоПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказКлиента</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ДокументОтгрузки</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ERP.belugaerp/src/Documents/битПоступлениеДенежныхСредствОтРозничногоПокупателя/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ЗаполнитьТаблицуОплат(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru='Не заполнено поле ""Организация"".'");
		ПоказатьПредупреждение(, ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияДиалога", ЭтаФорма);
	ПоказатьВопрос(ОписаниеОповещения, "Установить отбор по Контрагенту?", РежимДиалогаВопрос.ДаНетОтмена, 10,, "Установка отбора");
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияДиалога(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено
		Или Результат = КодВозвратаДиалога.Отмена Тогда
		Возврат;
	ИначеЕсли Результат = КодВозвратаДиалога.Да Тогда
		ОписаниеОповещения = Новый ОписаниеОповещения("ОкончаниеВыбораКонтрагентов", ЭтаФорма);
				
		ДопПараметры = Новый Структура("МножественныйВыбор", Истина);
	
		ОткрытьФорму("Справочник.Контрагенты.ФормаВыбора", ДопПараметры, 
															ЭтаФорма,,,,ОписаниеОповещения, 
															РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);		
	Иначе		
		ЗаполнитьОплаты();
	КонецЕсли;		
			
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеВыбораКонтрагентов(Результат, ДопПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьОплаты(Результат);
		
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТаблицаОплаты

&НаКлиенте
Процедура ОплатыДокументОтгрузкиНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
	ДопПараметры = Новый Структура();
	УстановитьПараметрыФормыПодбораРТиУ(ДопПараметры);
		
	ОписаниеОповещения = Новый ОписаниеОповещения("ОплатыДокументОтгрузкиОкончаниеВыбора", ЭтаФорма);
	
	ОткрытьФорму("Документ.битПоступлениеДенежныхСредствОтРозничногоПокупателя.Форма.ФормаПодбораДокументаОтгрузки", 
				ДопПараметры, ЭтаФОрма,,,, ОписаниеОповещения, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОплатыДокументОтгрузкиОкончаниеВыбора(Результат, ДопПараметры) Экспорт

	Если Результат = Неопределено Тогда
		Возврат;				
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Элементы.Оплаты.ТекущиеДанные.Контрагент) 
		Или Не ЗначениеЗаполнено(Элементы.Оплаты.ТекущиеДанные.Договор) Тогда
	    ЗаполнитьЗначенияСвойств(Элементы.Оплаты.ТекущиеДанные, Результат.КонтрагентДоговор);					
	КонецЕсли; 
	
	ЗаполнитьЗначенияСвойств(Элементы.Оплаты.ТекущиеДанные, Результат);	
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПараметрыФормыПодбораРТиУ(ДопПараметры)
	
	ДопПараметры.Вставить("РежимВыбора", Истина);
	
	ТекущиеДанные = Элементы.Оплаты.ТекущиеДанные;
		
	ЗначенияОтборов = Новый Структура;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Контрагент) Тогда
		 ЗначенияОтборов.Вставить("Контрагент", ТекущиеДанные.Контрагент);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Договор) Тогда
		 ЗначенияОтборов.Вставить("Договор", ТекущиеДанные.Договор);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		 ЗначенияОтборов.Вставить("Организация", Объект.Организация);
	КонецЕсли;
		
	Если ЗначенияОтборов.Количество() > 0 Тогда
		ДопПараметры.Вставить("ОтборСписка", ЗначенияОтборов);
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьСуммуДокумента()

	Объект.СуммаПоДокументу = Объект.Оплаты.Итог("СуммаВРозницу");
	
КонецПроцедуры

&НаКлиенте
Процедура ОплатыПриИзменении(Элемент)
	ПересчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьОплаты(Контрагенты = Неопределено)

	Объект.Оплаты.Очистить();
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		МоментВремени = Объект.Ссылка.МоментВремени();
	Иначе
		МоментВремени = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыСРозничнымиКлиентамиОстатки.ДокументОтгрузки КАК ДокументОтгрузки,
	|	РасчетыСРозничнымиКлиентамиОстатки.ДокументОтгрузки.СуммаДокумента КАК Сумма,
	|	РасчетыСРозничнымиКлиентамиОстатки.Организация КАК Организация,
	|	РасчетыСРозничнымиКлиентамиОстатки.Контрагент КАК Контрагент,
	|	РасчетыСРозничнымиКлиентамиОстатки.Договор КАК Договор,
	|	РасчетыСРозничнымиКлиентамиОстатки.СуммаВРозницуОстаток КАК СуммаВРозницу
	|ИЗ
	|	РегистрНакопления.бг_РасчетыСРозничнымиКлиентами.Остатки(&Период, Организация = &Организация) КАК РасчетыСРозничнымиКлиентамиОстатки";

	Если Контрагенты <> Неопределено Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, 
			"Организация = &Организация",  
			"Организация = &Организация И Контрагент В (&Контрагенты)");
	Иначе
		Объект.Оплаты.Очистить();
	КонецЕсли;
	
	Граница = Новый Граница(МоментВремени, ВидГраницы.Исключая);
		
	Запрос.УстановитьПараметр("Контрагенты", Контрагенты);
	Запрос.УстановитьПараметр("Период", Граница);
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Оплаты.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти
